{
  "site_name": "StarScope",
  "nav_home": "Home",
  "nav_archive": "Archive",
  "nav_about": "About",
  "lang_switcher_text": "中文",
  "dark_mode_label": "Toggle Dark Mode",
  "hero_title": "Discover Trending GitHub Projects",
  "hero_subtitle": "A curated platform for discovering trending and interesting GitHub projects. Updated daily with the most talked-about and fast-rising repos to help you stay ahead of the curve in open-source innovation and creative tech.",
  "previous_day": "Previous Day",
  "next_day": "Next Day",
  "total_projects": "projects",
  "view_source_code": "View Source Code",
  "copyright": "All data sourced from GitHub.",
  "new_badge": "New",
  "archive_title": "Archive",

  "about_title": "About StarScope",
  "about_intro_p1": "Hi! I'm the creator of StarScope, a developer passionate about uncovering remarkable open-source projects. In today's information-saturated world, it's easy to miss the truly noteworthy new projects emerging on GitHub. That's why I built StarScope — to manually browse, select, and organize the most starred, fastest-growing, and most discussed projects each day, presenting them in a clean, elegant, and archive-friendly format.",
  "about_philosophy_h2": "Our Philosophy",
  "about_philosophy_p1": "StarScope is built on the principle of \"Curated Simplicity.\" We believe:",
  "about_philosophy_li1": "Content First, Design Second: The interface never gets in the way. Every design choice serves the content. Clear star growth metrics, accurate descriptions, and intuitive language tags help you instantly grasp a project's value.",
  "about_philosophy_li2": "Human Curation Adds Meaning: Machines can count stars, but only humans can recognize what's truly interesting. Every project is hand-reviewed and evaluated to ensure it's not just popular — but worthwhile.",
  "about_philosophy_li3": "Archivable and Traceable: Today’s rising star could be tomorrow’s classic. We archive every daily recommendation, creating a living logbook of open-source discovery.",
  "about_tech_h2": "Technical Implementation",
  "about_tech_p1": "StarScope is a fully static website built with the following stack:",
  "about_tech_li1": "Frontend: HTML5, CSS3, JavaScript (Vanilla)",
  "about_tech_li2": "Data Curation: Every entry is manually researched, selected, and refined to ensure quality and readability.",
  "about_tech_li3": "Automation: A Python script with Jinja2 templates generates the site daily.",
  "about_tech_li4": "Deployment: Published on GitHub Pages via GitHub Actions.",
  "about_contact_h2": "Get in Touch",
  "about_contact_p1": "If you have any suggestions or feedback, feel free to reach out:",
  "about_contact_li1": "Email: junglehxj@gmail.com",
  "about_contact_li2": "GitHub: https://github.com/jungleAI404/github-stars"
}