{
    "site_name": "StarScope",
    "nav_home": "Home",
    "nav_archive": "Archive",
    "nav_about": "About",
    "lang_switcher_text": "中文",
    "dark_mode_label": "Toggle Dark Mode",
    "hero_title": "Discover Trending GitHub Projects",
    "hero_subtitle": "A curated platform for discovering trending GitHub projects with rapid star growth — helping you stay ahead with the most exciting open-source innovations.",
    "previous_day": "Previous Day",
    "next_day": "Next Day",
    "total_projects": "projects",
    "view_source_code": "View Source Code",
    "copyright": "All data from GitHub.",
    "new_badge": "NEW",
    "archive_title": "Archive",

    "about_title": "About StarScope",
    "about_intro_p1": "Hello! I'm the creator of Daily Stars, a developer passionate about open source and technology. In this era of information overload, I found it challenging to track the truly noteworthy emerging projects on GitHub. Therefore, I created Daily Stars, hoping to help more developers discover valuable new projects.",
    "about_philosophy_h2": "Project Philosophy",
    "about_philosophy_p1": "The core idea behind Daily Stars is \"Data-Driven Minimalism\". We believe in:",
    "about_philosophy_li1": "Content is King: Design should serve the data and content. All visual elements are aimed at enhancing the clarity of information, not distracting from it.",
    "about_philosophy_li2": "High Signal-to-Noise Ratio: Remove all unnecessary decorations and pursue a functional aesthetic.",
    "about_philosophy_li3": "Data Visualization: Present project growth trends in an intuitive way.",
    "about_tech_h2": "Technical Implementation",
    "about_tech_p1": "Daily Stars is a fully static website built with the following stack:",
    "about_tech_li1": "Frontend: HTML5, CSS3, JavaScript (Vanilla)",
    "about_tech_li2": "Data Retrieval: Project data is automatically fetched via the GitHub API.",
    "about_tech_li3": "Automation: A Python script with Jinja2 templates generates the site daily.",
    "about_tech_li4": "Deployment: Deployed on GitHub Pages via GitHub Actions.",
    "about_contact_h2": "Contact Me",
    "about_contact_p1": "If you have any suggestions or ideas, feel free to reach out to me:",
    "about_contact_li1": "Email: junglehxj@gmail.com",
    "about_contact_li2": "GitHub: https://github.com/jungleAI404/github-daily-star"
}